# YOLOv5 ?? by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, GhostPModule, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, GhostPModule, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3GhostP, [128]],
   [-1, 1, GhostPModule, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3GhostP, [256]],
   [-1, 1, GhostPModule, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3GhostP, [512]],
   [-1, 1, GhostPModule, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, C3GhostP, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 9
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, GhostPModule, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [6, 1, GhostPModule, [512, 1, 1]], # 12  256 40 40
   [[-1, -2], 1, Concat, [1]],  # 13 cat backbone P4  12  512 40 40
   [-1, 3, C3GhostFpn, [512, False]], # 14 256 40 40


   [-1, 1, GhostPModule, [256, 1, 1]], # 15 128 40 40
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 16 128 80 80
   [4, 1, GhostPModule, [256, 1, 1]], # 17 128 80 80  
   [[-1, -2], 1, Concat, [1]],  # 18 cat backbone P3 16 256 80 80
   
   [-1, 3, C3GhostFpn, [256, False]], #19 128 80 80
   [15, 3, C3GhostFpn, [512, False]], #21 256 40 40
   [10, 3, C3GhostFpn, [1024, False]], #20 512 20 20
   
   [[19, 20, 21], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
