# YOLOv5 ?? by Ultralytics, GPL-3.0 license
# Parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 0.5  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32
# Ghostnet backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 3, 2, 1]],  #0  0
   [-1, 1, GhostConv, [128, 3, 2]], #1 1
   [-1, 1, Conv, [64, 1, 1]], #2  2
   [-1, 1, shortcut, [64]], #3  3
   [-2, 1, Ghost_shuffle_BottleneckStack, [64]], #4  4
   [[-1, -2], 1, Add, [1]], # 5  5
   [1, 1, Conv, [64, 1, 1]], #6  5  6
   [[-1, -2], 1, Concat, [1]], #7  6  7
   [-1, 1, Conv, [128, 1, 1]], #8  7  8
   [-1, 1, GhostConv, [256, 3, 2]], #9  8  9
   [-1, 1, Conv, [128, 1, 1]], #10  9  10
   [-1, 1, shortcut, [128]], #11  10  11
   [-2, 2, Ghost_shuffle_BottleneckStack, [128]], #12  11 12
   [[-1, -2], 1, Add, [1]],  #13
   [9, 1, Conv, [128, 1, 1]], #16  12  14
   [[-1, -2], 1, Concat, [1]], #17   13  15
   [-1, 1, Conv, [256, 1, 1]], #18   14  16
   [-1, 1, GhostConv, [512, 3, 2]], #19  15  17
   [-1, 1, Conv, [256, 1, 1]], #20  16  18
   [-1, 1, shortcut, [256]], #21  17  19
   [-2, 3, Ghost_shuffle_BottleneckStack, [256]], #22  18 20
   [[-1, -2], 1, Add, [1]], #21
   [17, 1, Conv, [256, 1, 1]], #28  19  22
   [[-1, -2], 1, Concat, [1]], #29  20  23
   [-1, 1, Conv, [512, 1, 1]], #30  21  24
   [-1, 1, GhostConv, [1024, 3, 2]], #31  22  25
   [-1, 1, Conv, [512, 1, 1]], #32   23  26
   [-1, 1, shortcut, [512]], #33  24  27
   [-2, 1, Ghost_shuffle_BottleneckStack, [512]], #34  25  28
   [[-1, -2], 1, Add, [1]], #29
   [25, 1, Conv, [512, 1, 1]], #36   26  30
   [[-1, -2], 1, Concat, [1]], #37   27 31
   [-1, 1, Conv, [1024, 1, 1]], #38   28  32
   [-1, 1, SPPF, [1024, 5]], #39  29  33
  ]
# YOLOv5 v6.0 head
head:
  [[-1, 1, GhostConv, [512, 1, 1]], #40   30 34
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #41  31 35
   [[-1, 24], 1, Concat, [1]],  # cat backbone P4 42   32 36
   [-1, 1, Conv, [256, 1, 1]], #43  33 37
   [-1, 1, shortcut, [256]], #44   34 38
   [-2, 1, Ghost_shuffle_BottleneckStack, [256]], #45  35 39
   [[-1, -2], 1, Add, [1]], #40
   [36, 1, Conv, [256, 1, 1]], #47   36 41
   [[-1, -2], 1, Concat, [1]], #48   37 42
   [-1, 1, Conv, [512, 1, 1]], #49   38 43


   [-1, 1, GhostConv, [256, 1, 1]], #50  39 44
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #51  40 45
   [[-1, 16], 1, Concat, [1]],  # cat backbone P3 52   41 46
   [-1, 1, Conv, [128, 1, 1]], #53  41 47
   [-1, 1, shortcut, [128]], #54   43 48
   [-2, 1, Ghost_shuffle_BottleneckStack, [128]], #55  44 49
   [[-1, -2], 1, Add, [1]], #50
   [46, 1, Conv, [128, 1, 1]], #57  45 51
   [[-1, -2], 1, Concat, [1]], #58  46 52
   [-1, 1, Conv, [256, 1, 1]], #59  47 53

   [-1, 1, GhostConv, [256, 3, 2]], # 60   48 54
   [[-1, 44], 1, Concat, [1]],  # cat head P4 61 55  49
   [-1, 1, Conv, [256, 1, 1]], #62  50 56
   [-1, 1, shortcut, [256]], #63  51 57
   [-2, 1, Ghost_shuffle_BottleneckStack, [256]], #64  52 58
   [[-1, -2], 1, Add, [1]], #59
   [55, 1, Conv, [256, 1, 1]], #66  53 60
   [[-1, -2], 1, Concat, [1]], #67 54 61
   [-1, 1, Conv, [512, 1, 1]], #68  55 62

   [-1, 1, GhostConv, [512, 3, 2]], #69   56 63
   [[-1, 34], 1, Concat, [1]],  # cat head P5 70  57 64
   [-1, 1, Conv, [512, 1, 1]], #71  58 65
   [-1, 1, shortcut, [512]], #72  59 66
   [-2, 1, Ghost_shuffle_BottleneckStack, [512]], #73  60 67
   [[-1, -2], 1, Add, [1]], #68
   [64, 1, Conv, [512, 1, 1]], #75  61 69
   [[-1, -2], 1, Concat, [1]], #76  62 70
   [-1, 1, Conv, [1024, 1, 1]], #77   63 71

   [[53, 62, 71], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]