# YOLOv5 🚀 by Ultralytics, GPL-3.0 license
# Parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 0.5  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32
# Ghostnet backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 3, 2, 1]],  #0
   [-1, 1, GhostConv, [128, 3, 2]], #1
   [-1, 1, Conv, [64, 1, 1]], #2
   [-1, 1, shortcut, [64]], #3
   [-2, 1, ghostbottleneck, [64]], #4
   [[-1, -2], 1, Concat, [1]], #5
   [-1, 1, Conv, [128, 1, 1]], #8
   [-1, 1, GhostConv, [256, 3, 2]], #9
   [-1, 1, Conv, [128, 1, 1]], #10
   [-1, 1, shortcut, [128]], #11
   [-2, 1, ghostbottleneck, [128]], #12
   [-1, 1, shortcut, [128]], #13
   [-2, 1, ghostbottleneck, [128]], #14
   [[-1, -2], 1, Add, [1]], #15
   [[-1, -5], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]], #18
   [-1, 1, GhostConv, [512, 3, 2]], #19
   [-1, 1, Conv, [256, 1, 1]], #20
   [-1, 1, shortcut, [256]], #21
   [-2, 1, ghostbottleneck, [256]], #22
   [-1, 1, shortcut, [256]], #23
   [-2, 1, ghostbottleneck, [256]], #24
   [-1, 1, shortcut, [256]], #25
   [-2, 1, ghostbottleneck, [256]], #26
   [[20, 22, 23], 1, Add, [1]], #27
   [[-1, 17], 1, Concat, [1]],
   [-1, 1, Conv, [512, 1, 1]], #30
   [-1, 1, GhostConv, [1024, 3, 2]], #31
   [-1, 1, Conv, [512, 1, 1]], #32
   [-1, 1, shortcut, [512]], #33
   [-2, 1, ghostbottleneck, [512]], #34
   [[-1, -2], 1, Concat, [1]], #35
   [-1, 1, Conv, [1024, 1, 1]], #38
   [-1, 1, SPPF, [1024, 5]], #39
  ]
# YOLOv5 v6.0 head
head:
  [[-1, 1, GhostConv, [512, 1, 1]], #40
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #41
   [[-1, 26], 1, Concat, [1]],  # cat backbone P4 42
   [-1, 1, Conv, [256, 1, 1]], #43
   [-1, 1, shortcut, [256]], #44
   [-2, 1, ghostbottleneck, [256]], #45
   [[-1, -2], 1, Concat, [1]], #46
   [-1, 1, Conv, [512, 1, 1]], #49


   [-1, 1, GhostConv, [256, 1, 1]], #50
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #51
   [[-1, 15], 1, Concat, [1]],  # cat backbone P3 52
   [-1, 1, Conv, [128, 1, 1]], #53
   [-1, 1, shortcut, [128]], #54
   [-2, 1, ghostbottleneck, [128]], #55
   [[-1, -2], 1, Concat, [1]], #56
   [-1, 1, Conv, [256, 1, 1]], #59

   [-1, 1, GhostConv, [256, 3, 2]], # 60
   [[-1, 42], 1, Concat, [1]],  # cat head P4 61
   [-1, 1, Conv, [256, 1, 1]], #62
   [-1, 1, shortcut, [256]], #63
   [-2, 1, ghostbottleneck, [256]], #64
   [[-1, -2], 1, Concat, [1]], #65
   [-1, 1, Conv, [512, 1, 1]], #68

   [-1, 1, GhostConv, [512, 3, 2]], #69
   [[-1, 34], 1, Concat, [1]],  # cat head P5 70
   [-1, 1, Conv, [512, 1, 1]], #71
   [-1, 1, shortcut, [512]], #72
   [-2, 1, ghostbottleneck, [512]], #73
   [[-1, -2], 1, Concat, [1]], #74
   [-1, 1, Conv, [1024, 1, 1]], #77

   [[49, 56, 63], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]